In [41]:
import pandas as pd
import numpy as np

In [42]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States'] = "CA NV AZ".split()
df.set_index('States',inplace=True)

In [43]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## Dropping row or columns based on the nan values

In [44]:
df.dropna(axis=0)
## here i am giving axis = 0 hence it will drop the rows that have nan values

          A    B  C
States
CA      1.0  5.0  1

In [45]:
df.dropna(axis=1)
# ## here i am giving axis = 1 hence it will drop the columns that have nan values

        C
States
CA      1
NV      2
AZ      3

In [46]:
df.dropna(thresh=2)
## Here what happens when thresh is 2 then what happens is if the row contains less that 2 NON-NAN values then it 
## will be dropped

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [47]:
df.dropna(thresh=2)
## here as you can see the rows are not getting dropped since the thresh is 1 and there is atleast one NON_NAN values
## in the dataframe

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [48]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## we have null values in the dataframe and now we should fill them using fillna

In [49]:
df.fillna(value="Fill value")
## here in place of value you can give whatever you want the NAN values to be filled with.

                 A           B  C
States
CA             1.0         5.0  1
NV             2.0  Fill value  2
AZ      Fill value  Fill value  3

## we will fill the null values by mean of column A

In [50]:
df.fillna(value=df['A'].mean())
## you can see below that the null values are being filled or replaced with the average of column A

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  1.5  2
AZ      1.5  1.5  3

In [51]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df1 = pd.DataFrame(data)
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

## groupby

In [52]:
df1.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [54]:
df1.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [57]:
df1.groupby('Company')['Sales'].mean()
## here the using the groupby i found the mean of the sales from each company

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [59]:
df1.groupby('Company')['Sales'].sum()
## this is returning the summation of sales based on the companies

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64